In [5]:
# Data Cleaning - fixing bad data in data set
# bad data - empty cells, wrong data, duplicates, data in wrong format

In [1]:
import pandas as pd
import numpy as np

In [2]:
# Cleaning Empty Cells

df = pd.DataFrame({'name':['Alfred', 'Batman', 'Catwoman'],
                   'Toy':[np.nan, 'Batmobile', 'Bullwhip'],
                   'Born':[pd.NaT, pd.Timestamp('1940-04-25'),pd.NaT]})

print(df)

       name        Toy       Born
0    Alfred        NaN        NaT
1    Batman  Batmobile 1940-04-25
2  Catwoman   Bullwhip        NaT

In [34]:
print(df.info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   name    3 non-null      object
 1   Toy     2 non-null      object
 2   Born    1 non-null      datetime64[ns]
dtypes: datetime64[ns](1), object(2)
memory usage: 204.0+ bytes
None

In [11]:
df1 = df.dropna()
print(df1)

     name        Toy       Born
1  Batman  Batmobile 1940-04-25

In [ ]:
# Replace Empty Values -

In [35]:
df = pd.DataFrame({'name':['Alfred', pd.NA, 'Catwoman'],
                   'Toy':[np.nan, 'Batmobile', 'Bullwhip'],
                   'Born':[pd.NaT, pd.Timestamp('1940-04-25'),pd.NaT]})

print(df)

       name        Toy       Born
0    Alfred        NaN        NaT
1      <NA>  Batmobile 1940-04-25
2  Catwoman   Bullwhip        NaT

In [37]:
df.fillna(130, inplace = True)
print(df)

       name        Toy                 Born
0    Alfred        130                  130
1       130  Batmobile  1940-04-25 00:00:00
2  Catwoman   Bullwhip                  130

In [38]:
# Replace only for specified columns

In [39]:
df = pd.DataFrame({"name": ['Alfred', pd.NA, 'Catwoman'],
                   "toy": [np.nan, 'Batmobile', 'Bullwhip'],
                   "born": [pd.NaT, pd.Timestamp("1940-04-25"),
                            pd.NaT]})

df

       name        toy       born
0    Alfred        NaN        NaT
1      <NA>  Batmobile 1940-04-25
2  Catwoman   Bullwhip        NaT

In [41]:
df['name'].fillna('Batman',inplace = True)
print(df)

       name        toy       born
0    Alfred        NaN        NaT
1    Batman  Batmobile 1940-04-25
2  Catwoman   Bullwhip        NaT

In [43]:
df['toy'].fillna('Comic',inplace = True)
print(df)

       name        toy       born
0    Alfred      Comic        NaT
1    Batman  Batmobile 1940-04-25
2  Catwoman   Bullwhip        NaT

In [44]:
df.loc[0,'born'] = '1950-05-20'
print(df)

       name        toy       born
0    Alfred      Comic 1950-05-20
1    Batman  Batmobile 1940-04-25
2  Catwoman   Bullwhip        NaT

In [45]:
# Replace using mean, median, mode
# Pandas uses the mean(), median(), mode() method to calculate the values for specified column.

In [46]:
df = pd.DataFrame({"item": ["milk","sugar","chips","coffee"],
                   "quantity": [2,1,5,4],
                   "price": [67, pd.NA,45,73]})

df

     item  quantity price
0    milk         2    67
1   sugar         1  <NA>
2   chips         5    45
3  coffee         4    73

In [48]:
df['price'] = df['price'].fillna(df['price'].mean())
df

     item  quantity      price
0    milk         2  67.000000
1   sugar         1  61.666667
2   chips         5  45.000000
3  coffee         4  73.000000

In [51]:
# cleaning data of wrong format

In [3]:
df_date = pd.DataFrame({"Duration": [60,60,60,45,45,60,60,450,30,60,60],
                   "Pulse": [110,117,103,109,117,102,104,109,98,100,100],
                   "Calories": [409.1,479.0,340.0,282.4,406.0,300.0,374.0,253.3,195.1,269.0,269.0],
                   "Date": ['2020/12/01','2020/12/02',"20201203",'2020/12/04','2020/12/05',pd.NA,'2020/12/07','2020/12/08','2020/12/09','2020/12/10','2020/12/10']})

df_date

    Duration  Pulse  Calories        Date
0         60    110     409.1  2020/12/01
1         60    117     479.0  2020/12/02
2         60    103     340.0    20201203
3         45    109     282.4  2020/12/04
4         45    117     406.0  2020/12/05
5         60    102     300.0        <NA>
6         60    104     374.0  2020/12/07
7        450    109     253.3  2020/12/08
8         30     98     195.1  2020/12/09
9         60    100     269.0  2020/12/10
10        60    100     269.0  2020/12/10

In [5]:
# df_date['Date'] = pd.to_datetime(df_date['Date'])

# print(df_date)